cheap_word_list = [
    'ราคาถูก', 'ประหยัด', 'ย่อมเยา', 'คุ้มค่า', 'ไม่แพง', 'ราคาย่อมเยา', 'ถูกใจ', 'สบายกระเป๋า',
    'ถูกสุดๆ', 'คุ้มราคา', 'คุ้มค่าเงิน', 'ไม่ต้องจ่ายมาก', 'ราคาพอรับได้', 'ราคาเบาๆ', 'คุ้มเกินคาด',
    'ราคายอมรับได้', 'ราคาสมเหตุสมผล', 'ถูกกว่าที่คิด', 'ราคาพอดี', 'ประหยัดงบ', 'ถูกพิเศษ', 'ลดราคา',
    'มีโปรโมชั่น', 'ราคาสุดคุ้ม', 'คุ้มเงิน', 'ประหยัดเงิน', 'ลดพิเศษ', 'ราคาลดลง', 'ราคาถูกมาก', 'ไม่แพงมาก',
    'ราคาน่าซื้อ', 'น่าสนใจราคา', 'คุ้มทุน', 'ไม่แพงเลย', 'ราคาสะดวก', 'ถูกจริง', 'คุ้มค่ามาก', 'ลดราคาพิเศษ',
    'คุ้มที่สุด', 'ราคาต่ำ', 'ราคาถูกอย่างไม่น่าเชื่อ', 'ราคาสุดพิเศษ', 'ถูกใจราคานี้', 'น่าใช้ราคา', 'ราคาสมควร',
    'ราคาถูกมากๆ', 'ราคาถูกใจ', 'ราคาถูกคุ้มค่า', 'ราคาลดพิเศษ', 'ราคาถูกอย่างไม่น่าเชื่อ', 'ราคาลดพิเศษสุดๆ',
    'ราคาถูกน่าซื้อ', 'ราคาลดคุ้ม', 'ราคาลดสะดวก', 'ราคาถูกที่สุด', 'ราคาน่าใช้', 'ราคาถูกไม่แพง', 'ราคาสบายๆ',
    'ราคาน่าพอใจ', 'ราคาถูกจริงๆ', 'ราคาลดพิเศษอย่างไม่น่าเชื่อ', 'ราคาลดสะดวกคุ้ม', 'ราคาถูกน่าพอใจ', 'ราคาคุ้มๆ',
    'ราคาลดถูกใจ', 'ราคาถูกสะดวก', 'ราคาถูกง่ายๆ', 'ราคาลดคุ้มค่า', 'ราคาสะดวกน่าซื้อ', 'ราคาลดไม่แพง', 'ราคาน่าสนใจ',
    'ราคาถูกใช้ได้', 'ราคาสะดวกมาก', 'ราคาถูกคุ้มค่าเงิน', 'ราคาลดสะดวกใช้ได้', 'ราคาสะดวกใจ', 'ราคาลดใช้ได้',
    'ราคาถูกง่าย', 'ราคาลดง่ายๆ', 'ราคาถูกใจที่สุด', 'ราคาสะดวกสบาย', 'ราคาถูกคุ้มทุน', 'ราคาน่าซื้อสะดวก',
    'ราคาลดสะดวกมาก', 'ราคาถูกคุ้มที่สุด', 'ราคาน่าสนใจมาก', 'ราคาลดพิเศษสะดวก', 'ราคาถูกน่าสนใจ', 'ราคาลดง่ายๆ',
    'ราคาลดน่าซื้อ', 'ราคาถูกใจง่ายๆ', 'ราคาลดพิเศษง่าย', 'ราคาสะดวกคุ้มค่า', 'ราคาถูกสะดวกง่าย', 'ราคาลดน่าพอใจ',
    'ราคาสะดวกมากๆ', 'ราคาถูกที่สุดในตลาด', 'ราคาลดง่ายสะดวก', 'ราคาถูกมากสะดวก', 'ราคาสะดวกน่าซื้อที่สุด'
]

expensive_word_list =[
    'แพง', 'ราคาแพง', 'ราคาสูง', 'แพงมาก', 'ราคาแรง', 'ราคาพุ่ง', 'ค่าครองชีพสูง', 'ราคาพรีเมียม',
    'ค่าราคา', 'ราคาหรู', 'แพงหูฉี่', 'ราคามหาโหด', 'ค่าตัวสูง', 'ราคาสูงลิบ', 'ราคาสุดโหด', 'แพงเกินไป',
    'ค่าตัวแพง', 'ราคาทะลุฟ้า', 'แพงหูดับตับไหม้', 'ราคาน่าตกใจ', 'ค่าสูง', 'แพงอักโข', 'แพงเว่อร์', 'ราคาหนัก',
    'แพงระยิบ', 'ค่าสินค้าสูง', 'ค่าครองชีพแพง', 'ราคาแพงลิบ', 'แพงทะลุเพดาน', 'ราคามหาศาล', 'แพงเวอร์วัง', 
    'ราคาอ่วม', 'แพงบาดใจ', 'ค่าสูงลิ่ว', 'ราคาท่วมท้น', 'แพงเอาเรื่อง', 'ราคาครึ่งหมื่น', 'แพงโข', 
    'ค่าระดับสูง', 'ราคาเยอะ', 'แพงเกินจริง', 'ค่าตัวแพงลิ่ว', 'ราคาจัดหนัก', 'แพงเวอร์วังอลังการ', 
    'ค่าของสูง', 'ราคาอลังการ', 'แพงจัดจ้าน', 'ค่าผลิตสูง', 'ราคาฟ้า', 'แพงสุดใจ', 'ค่าสูงลิบลิ่ว', 
    'ราคาแพงหูฉี่', 'แพงหูแตก', 'ราคาสุดพุ่ง', 'แพงลิบลิ่ว', 'ค่าสินค้าแพง', 'ราคาโหด', 'แพงหูช้าง', 
    'ค่าครองชีพสูงลิ่ว', 'ราคาแพงเว่อร์', 'แพงเว่อร์', 'ราคาทะลวง', 'แพงสะบัด', 'ค่าสูงเว่อร์', 
    'ราคาแพงลิบลิ่ว', 'แพงสุดโหด', 'ค่าของแพง', 'ราคามหาโหดลิ่ว', 'แพงตระการตา', 'ค่าตัวสูงลิ่ว', 
    'ราคาหูดับ', 'แพงมากๆ', 'ค่าสูงจัด', 'ราคาทะลุฟาก', 'แพงรุนแรง', 'ค่าครองชีพแพงลิ่ว', 
    'ราคาอลังการงานสร้าง', 'แพงเกินเบอร์', 'ค่าสูงสุดใจ', 'ราคาสุดพลัง', 'แพงสุดลิบ', 'ค่าสินค้าสูงลิ่ว', 
    'ราคาแรงเวอร์', 'แพงขาดใจ', 'ค่าของสูงลิบลิ่ว', 'ราคาตระการตา', 'แพงสุดอลังการ', 'ค่าสูงเกินเบอร์', 
    'ราคาทะลวงฟ้า', 'แพงยับ', 'ค่าผลิตแพง', 'ราคาฟ้าสุดใจ', 'แพงสุดพลัง', 'ค่าราคาแพง', 'ราคาตระการตาลิ่ว', 
    'แพงสุดเวอร์', 'ค่าสูงเว่อร์วัง', 'ราคาฟ้าสุดโหด', 'แพงรุนแรงลิ่ว', 'ค่าสูงเกินจริง'
]


class MyDictionary: 
    my_dict = {
        "ถูก": cheap_word_list , 
        "แพง" : expensive_word_list
    }

    def is_cheaper(self,word_list): 
        for word in word_list:
            if any(cheap_word in word for cheap_word in self.my_dict["ถูก"]):
                return True
        return False
    
    def is_expensive(self,word_list): 
        for word in word_list:
            if any(cheap_word in word for cheap_word in self.my_dict["แพง"]):
                return True
        return False
    